[NoCoverage] Block removal mutation
BankAccount.cs:24:17
 
         public string CustomerName
         {
-            get { return m_customerName; }
+            get {}
         }
 

[Killed] Block removal mutation
BankAccount.cs:29:17
 
         public double Balance
         {
-            get { return m_balance; }
+            get {}
         }
 
killedBy: Bank.UnitTests.BankAccountTest.Debit_WithValidAmount_UpdatesBalance

[NoCoverage] Statement mutation
BankAccount.cs:36:17
         {
             if (amount > m_balance)
             {
-                throw new ArgumentOutOfRangeException("amount");
+                ;
             }
 

[NoCoverage] String mutation
BankAccount.cs:36:55
         {
             if (amount > m_balance)
             {
-                throw new ArgumentOutOfRangeException("amount");
+                throw new ArgumentOutOfRangeException("");
             }
 

[Killed] Equality mutation
BankAccount.cs:39:17
                 throw new ArgumentOutOfRangeException("amount");
             }
 
-            if (amount < 0)
+            if (amount > 0)
             {
                 throw new ArgumentOutOfRangeException("amount");
killedBy: Bank.UnitTests.BankAccountTest.Debit_WithValidAmount_UpdatesBalance

[Killed] Negate expression
BankAccount.cs:39:17
                 throw new ArgumentOutOfRangeException("amount");
             }
 
-            if (amount < 0)
+            if (!(amount < 0))
             {
                 throw new ArgumentOutOfRangeException("amount");
killedBy: Bank.UnitTests.BankAccountTest.Debit_WithValidAmount_UpdatesBalance

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
BankAccount.cs:44:13
                 throw new ArgumentOutOfRangeException("amount");
             }
 
-            m_balance -= amount;
+            m_balance += amount;
         }
 
killedBy: Bank.UnitTests.BankAccountTest.Debit_WithValidAmount_UpdatesBalance

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
BankAccount.cs:54:13
                 throw new ArgumentOutOfRangeException("amount");
             }
 
-            m_balance += amount;
+            m_balance -= amount;
         }
     }
