[NoCoverage] String mutation
Program.cs:3:34
 using Bank.Account;
 
-BankAccount ba = new BankAccount("Mr. Bryan Walton", 11.99);
+BankAccount ba = new BankAccount("", 11.99);
 
 ba.Credit(5.77);

[NoCoverage] Statement mutation
Program.cs:5:1
 
 BankAccount ba = new BankAccount("Mr. Bryan Walton", 11.99);
 
-ba.Credit(5.77);
+;
 ba.Debit(11.22);
 Console.WriteLine("Current balance is ${0}", ba.Balance);

[NoCoverage] Statement mutation
Program.cs:6:1
 BankAccount ba = new BankAccount("Mr. Bryan Walton", 11.99);
 
 ba.Credit(5.77);
-ba.Debit(11.22);
+;
 Console.WriteLine("Current balance is ${0}", ba.Balance);
 Console.ReadLine();

[NoCoverage] Statement mutation
Program.cs:7:1
 
 ba.Credit(5.77);
 ba.Debit(11.22);
-Console.WriteLine("Current balance is ${0}", ba.Balance);
+;
 Console.ReadLine();

[NoCoverage] Statement mutation
Program.cs:8:1
 ba.Credit(5.77);
 ba.Debit(11.22);
 Console.WriteLine("Current balance is ${0}", ba.Balance);
-Console.ReadLine();
+;
